app/views/milestones/_show.html.erb

<% @project.milestones.order("date asc").each_with_index do |x,y| %>
---
SELECT `milestones`.* FROM `milestones` WHERE `milestones`.`project_id` = 1 ORDER BY date asc