app/views/clients/index.html.erb

  </div>
<% Client.all.each do |c| %>
---
SELECT `clients`.* FROM `clients`