app/views/projects/_form.html.erb

SELECT `clients`.* FROM `clients`
---
      <div class="controls">
        <%= f.collection_select( :client_id, Client.all, :id, :name, options = { :prompt => "#{t('project.select_client')}" } ) =%>