app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT `clients`.* FROM `clients`

  def create
    # Se crea el cliente
    @client = Client.new(params[:client])
    # Se crean los contactos
    @client.contacts.each do |contact|
        contact.password = contact.name
        contact.language = params[:client][:language]
    end
    if @client.valid? and @client.contacts.map(&:valid?).all?
      # Se salva el cliente
      @client.save
---
SELECT `clients`.* FROM `clients`
INSERT INTO `clients` (`created_at`, `image`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `language`, `name`, `updated_at`) VALUES ('2014-03-30 20:52:09', '', NULL, NULL, NULL, NULL, 'es', 'Test Client', '2014-03-30 20:52:09')