app/controllers/forms_controller.rb

SELECT `forms`.* FROM `forms`
---
  def index
    @forms = Form.all