app/controllers/milestones_controller.rb

  def edit
    @milestone = Milestone.find(params[:id])
---
SELECT `milestones`.* FROM `milestones` WHERE `milestones`.`id` = 2 LIMIT 1