app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    # Lista todos los proyectos
    @projects = Project.all

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def show
    @focus_tab=params[:tab]
    # Se fija si hay que mostrar una tab especial al hacer el show,
    # sino, muestra la primera
    if @focus_tab== nil
      @focus_tab='1'
    end
    # Busca el proyecto por el id y lo muestra
    @project = Project.find(params[:id])

INSERT INTO `projects` (`client_id`, `created_at`, `description`, `filed`, `name`, `updated_at`) VALUES (1, '2014-03-30 20:52:44', '123', 0, 'Proyecto Test', '2014-03-30 20:52:44')
---
  def create
    @project = Project.new(params[:project])
    # Si se crea correctamente, se guarda y se redirige al show con un mensaje de exito,
    # sino, se hace un render al new del proyecto, dando el mensaje de error correspondiente
      if @project.save