app/controllers/search_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE '%g%') ORDER BY name asc LIMIT 8
SELECT `clients`.* FROM `clients` WHERE (name LIKE '%g%') ORDER BY name asc LIMIT 8
SELECT `projects`.* FROM `projects` WHERE (name LIKE '%g%') ORDER BY name asc LIMIT 8
SELECT `contents`.* FROM `contents` WHERE (summary LIKE '%g%') ORDER BY summary asc LIMIT 8
---
  def search_home
    # Busca en usuarios
    @users = User.search(params[:search_focus],LIMIT) || []
    # Busca en clientes
    @clients = Client.search(params[:search_focus],LIMIT) || []
    # Busca en proyectos
    @projects = Project.search(params[:search_focus],LIMIT) || []
    # Busca en Contenidos
    @contents = Content.search(params[:search_focus],LIMIT) || []