app/controllers/users_controller.rb

  def index
    @users = MooveitUser.all
---
SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('MooveitUser')

  def update_profile
    # Se fija si el usuario es de tipo Moove-it o Contacto
    if current_user.instance_of? MooveitUser
      type = :mooveit_user
    else
      type = :contact
    end
    # Chequea que parametros van a ser actualizados y los guarda
    # En caso de error redirige a la pagina de modificar perfil con el mensaje de error correspondiente
    if (params[type][:current_password] != "") || (params[type][:password] != "") || (params[type][:password_confirmation] != "")
      if User.authenticate(current_user.email, params[type][:current_password])
       if params[type][:password].empty?
          flash[:error] = I18n.t('user.empty_password')
          render 'edit_profile'
        else
          if current_user.update_attributes(params[type].except(:current_password))
---
UPDATE `users` SET `language` = 'en', `updated_at` = '2014-03-30 20:55:51' WHERE `users`.`type` IN ('MooveitUser') AND `users`.`id` = 1